resume_2018_v1_CN.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-13 一 13:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>袁龙简历</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">袁龙简历</h1>

<div id="orgbf0ddd2" class="outline-2">
<h2 id="orgbf0ddd2">个人信息</h2>
<div class="outline-text-2" id="text-orgbf0ddd2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b><span class="underline">8</span></b> 年工作经验,专注 Spark 框架, 深度学习, 强化学习</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Phone:</code> 18118801655</td>
</tr>

<tr>
<td class="org-left">持续的跟踪最新 <b><span class="underline">机器学习</span></b> 前沿论文</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Email:</code> <a href="mailto:yiddishkop@163.com">yiddishkop@163.com</a></td>
</tr>

<tr>
<td class="org-left">较好的机器学习 <b><span class="underline">算法</span></b> 知识</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Site :</code> <a href="https://yiddishkop.github.io/">yiddishkop's blog</a> or <a href="https://yiddi.coding.me">here</a></td>
</tr>

<tr>
<td class="org-left">较好的机器学习 <b><span class="underline">工程框架</span></b> 的实际使用经验</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Addr :</code> NanJing</td>
</tr>

<tr>
<td class="org-left">较好的 Spark 与 akka 处理 <b><span class="underline">高并发</span></b> 的经验</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">流畅的 <b><span class="underline">英文</span></b> 读写能力</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b><span class="underline">函数式</span></b> 编程, <b><span class="underline">Emacs</span></b> er</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="org3c457c9" class="outline-2">
<h2 id="org3c457c9">技术栈</h2>
<div class="outline-text-2" id="text-org3c457c9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><span class="underline"><b>Machine Learning toolkit</b></span></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="underline"><b>Machine Learning Algo</b></span></td>
</tr>

<tr>
<td class="org-left">Numpy, Scipy, Matplotlib, Pandas, Scikit-learn, Tensorflow, Keras</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">XGBOOST, YOLO, LR, GBDT, SVM, RF, CNN, RNN, GAN, LSTM, Q-learning, A3C</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><b>Spark Eco-system</b></span></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="underline"><b>Programming Language</b></span></td>
</tr>

<tr>
<td class="org-left">Spark, SparkSQL, SparkML, AKKA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Python, Scala, Java, C, lisp</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="underline"><b>Operating Systems</b></span></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><span class="underline"><b>Develop tools</b></span></td>
</tr>

<tr>
<td class="org-left">Linux, Mac OS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Emacs, Vim, Git</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="org2d72415" class="outline-2">
<h2 id="org2d72415">工作经验</h2>
<div class="outline-text-2" id="text-org2d72415">
</div>
<div id="org8b048a4" class="outline-4">
<h4 id="org8b048a4">数据科学软件工程师 @中兴,南京</h4>
<div class="outline-text-4" id="text-org8b048a4">
<p>
<span class="underline">Spark, SparkML, Scikit-Learn</span>
</p>

<p>
<i>03-2017 ~ present</i>
</p>

<p>
<i>PROJ: 中兴 IPTV GoldenData, 大数据处理分析平台</i>
</p>

<ul class="org-ul">
<li>使用 <b><span class="underline">Scikit-Learn, python</span></b> 预研机器学习算法模型, 向产品部汇报解释性说明文档.</li>
<li>使用 <b><span class="underline">Spark RDD</span></b> 实现 IPTV 服务器后端用户 log 数据提取/分析/预测, 提升原系统 MapReduce 性能.</li>
<li>基于 <b><span class="underline">SparkML</span></b>, 使用 <b><span class="underline">K-means, LR, GBDT, tSNE, PCA</span></b> 等算法模型对 IPTV 用户购买行为进行可视化/特征提取/分析预测.</li>
<li>独立完成基于 <b><span class="underline">scala</span></b> 开发 JSON 与 XML 文件解析模块, 解析用户请求消息并转换成 SparkSQL 语句, 完成数据查询.</li>
<li>使用 <b><span class="underline">SparkSQL</span></b> 完成部分用户 log 数据批量建/查/删/改工作.</li>
<li>使用 <b><span class="underline">SparkSQL, Data Fram, Pair RDD</span></b> 优化原有 Hadoop 架构下视频影像产品数据 ELT 操作.</li>
<li>维护部分 SBT 脚本, 完成工程部署/构建</li>
</ul>
</div>
</div>

<div id="org0078385" class="outline-4">
<h4 id="org0078385">大数据工程师 @中兴,南京</h4>
<div class="outline-text-4" id="text-org0078385">
<p>
<span class="underline">Spark, Hadoop</span> .
</p>

<p>
<i>03-2016 ~ 12-2016</i> .
</p>

<p>
<i>PROJ: 电信光猫网络服务器, 基于事件驱动实时管理</i> .
</p>

<ul class="org-ul">
<li>使用 <b><span class="underline">Spark Core, Spark Streaming, Spark SQL</span></b>, 参与实现实时流数据 ETL 模型, 提供实时数据用于数据分析.</li>
<li>参与实现基于远程过程调用 (RPC) 的 <b><span class="underline">高并发</span></b> API, 用于管理 <b><span class="underline">100w+</span></b> 电信光猫的连接/业务请求/错误日志上传.</li>
<li>参与定位和修正部分 Spark 问题.</li>
</ul>
</div>
</div>

<div id="org20f7f41" class="outline-4">
<h4 id="org20f7f41">高级软件工程师 @中兴,南京</h4>
<div class="outline-text-4" id="text-org20f7f41">
<p>
<span class="underline">Embedded OS, C</span> .
</p>

<p>
<i>01/2015 ~ 02/2016</i> .
</p>

<p>
<i>PROJ: 中兴 GPON'9112/9113'光网络终端系统开发</i> .
</p>

<ul class="org-ul">
<li>提出并使用 python 独立完成基于 secureCRT 的 <b><span class="underline">全模块自动测试</span></b> 框架, 帮助测试部节省大量测试时间.</li>
<li>参与 bootloader 修改.</li>
<li>参与完成 GPON9112/9113 路由子系统 API 的编写.</li>
<li>参与完成 GPON9112/9113 SDRAM 缓存系统内存管理模块 API 编写</li>
<li>参与完成 tr069 协议代码的实现</li>
<li>编写并维护 tr069 模块 makefile 工程文件</li>
</ul>
</div>
</div>
</div>
<div id="orgb89aefd" class="outline-2">
<h2 id="orgb89aefd">教育背景</h2>
<div class="outline-text-2" id="text-orgb89aefd">
</div>
<div id="org7a75e7c" class="outline-3">
<h3 id="org7a75e7c">学历教育</h3>
<div class="outline-text-3" id="text-org7a75e7c">
<ul class="org-ul">
<li>南京理工大学</li>
<li>计算机科学与技术本科学士学位</li>
</ul>
</div>
</div>
<div id="org77ea567" class="outline-3">
<h3 id="org77ea567">完成 MOOCs</h3>
<div class="outline-text-3" id="text-org77ea567">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">TaiDa ML Foundations &amp; Technical</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TaiDa DL with deep and structured</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://yiddishkop.github.io/DataScience.html#orgeeb8a29">my notes</a> or <a href="https://yiddi.coding.me/DataScience.html#org68e1611">here</a></td>
</tr>

<tr>
<td class="org-left">Ucberkeley cs-189: Introduction to ML</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://yiddishkop.github.io/DataScience.html#org5eba30f">my notes</a> or <a href="https://yiddi.coding.me/DataScience.html#org876e9fa">here</a></td>
</tr>

<tr>
<td class="org-left">Ucberkeley cs-294: Deep Reinforcement</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Stanford cs-231: CNN for visual recognition</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Stanford cs-20S: DL with Tensorflow</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://yiddishkop.github.io/DataScience.html#org7a6e1b3">my notes</a> or <a href="https://yiddi.coding.me/DataScience.html#orgfc192fb">here</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-08-13 一 13:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
